In [10]:
#Q1
import pandas as pd
ramen = pd.read_csv("ramen-ratings.csv")
ramen.head()
ramen = ramen.sort_values("Stars", ascending = False)
ramen.head()
ramen = ramen.iloc[3:, :]
ramen.head()

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
447,2133,Nissin,Kimchi Chikin Ramen Donburi,Bowl,Japan,5.00,NaN
454,2126,Nissin,Mennippon Oumi Chanpon,Bowl,Japan,5.00,NaN
603,1977,MyOri,Malaysia Penang Green Curry Vermicelli (New Pa...,Pack,Malaysia,5.00,NaN
530,2050,MyKuali,Penang Red Tom Yum Goong Noodle Authentic Taste,Cup,Malaysia,5.00,NaN
383,2197,Mr. Lee's Noodles,Hong Kong Street Beef,Cup,UK,5.00,NaN

In [15]:
#Q2
ramen['Stars']= ramen['Stars'].astype(float)
ramen.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2577 entries, 447 to 53
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Review #  2577 non-null   int64
 1   Brand     2577 non-null   object
 2   Variety   2577 non-null   object
 3   Style     2575 non-null   object
 4   Country   2577 non-null   object
 5   Stars     2577 non-null   float64
 6   Top Ten   41 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 161.1+ KB

In [16]:
#Q3
ramen['Stars'].mean()

3.6546759798214974

In [28]:
#Q4
#identify brands that have at least one 5-star ratings
ramen5 = ramen[ramen['Stars']==5.00]
ramen5.head()
ramen5.groupby('Brand').count()
#a total of 106 brands have at least one 5 star rating

                  Review #  Variety  Style  Country  Stars  Top Ten
Brand
A-Sha Dry Noodle         6        6      6        6      6        1
ABC                      1        1      1        1      1        0
Acecook                  1        1      1        1      1        0
Ah Lai                   1        1      1        1      1        0
Amianda                  1        1      1        1      1        0
...                    ...      ...    ...      ...    ...      ...
Wu Mu                    1        1      1        1      1        0
Wugudaochang             2        2      2        2      2        1
Xiao Ban Mian            1        1      1        1      1        0
Yamachan                 4        4      4        4      4        0
Yum Yum                  2        2      2        2      2        0

[106 rows x 6 columns]

In [45]:
#netflix_titles
#Q1
"""
Using the .groupby() and .count() method, 
get the number of unique movies of each release_year. 
You can regard show_id as the unique identifier of a movie.
"""
netflix = pd.read_csv("netflix-titles.csv")
netflix.head()
netflix.groupby('release_year')['show_id'].count()

release_year
1925       1
1942       2
1943       3
1944       3
1945       3
        ...
2016     830
2017     959
2018    1063
2019     843
2020      25
Name: show_id, Length: 72, dtype: int64

In [51]:
#Q2

netflix_ny = netflix[netflix['description'].str.contains("New York")]
netflix_ny.shape
#there are 73 movies that somehow pertain to New York.

(73, 12)

In [53]:
netflix_ny['description']

76      Two Turkish agents are sent to New York City o...
114     After 30 years with the New York City Ballet, ...
135     A New York City grad student moonlighting as a...
302     In this documentary, the director remembers a ...
363     After serving time in jail, a disgraced son re...
                              ...
5853    Set in 1960s New York City, this award-winning...
5942    A privileged New Yorker ends up in a women's p...
6076    A flawed but dedicated ER nurse works in a New...
6183    In 1977 New York City, the talented and soulfu...
6215    Still pining for Josh, the boy who dumped her ...
Name: description, Length: 73, dtype: object